Tekla Open API Reference for Tekla Structures 2025
Color Constructor
Overload List
Name | Description
Color()
 Creates a new color object. The default object is black.
Color(Double, Double, Double)
 Creates a new color object with the given values.
Color(Double, Double, Double, Double)
 Creates a new color object with the given values.
Top
See Also
Reference
Color Class
Tekla.Structures.Model.UI Namespace